package sample;

public class InputData {
    public static int cont1;
    public static int cont2;
    public static int cont3;


    public static double calculate() {



        return (cont1 + cont2 + cont3 - 200) / 10;

    }


    public static String massege() {
        double calci = calculate();
        if (calci >= 15) {
            return "Ваш стан серцево - судинної ситеми поганий," + "\n" + "мінімальні фізичні навантаження під контролем" + "\n" + "теренра.";
        }
        if (calci >= 10) {
            return "Ваш стан серцево - судинної ситеми слабкий," + "\n" + "будь-які фізичні навантаження тільки в пристуності" + "\n" + "тренера.";
        }
        if (calci >= 6) {
            return "Ваш стан серцево - судинної ситеми нормальний," + "\n" + "візичні вправи тільки по визначеній тренером програмі.";
        }
        if (calci >= 3) {
            return "Ваш стан серцево - судинної ситеми добрий," + "\n" + "тренування за програмою тренера, перевіряти" + "\n" + "пульст до і після тренування на витривалість(кардіо).";

        }
        return "Ваш стан серцево - судинної ситеми відмінний," + "\n" + "ви готові до важких візичних навантажень.";


    }
}
